#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
[command]/home/runner/work/_temp/3b9a311a-a781-45e1-8e5b-b2ffea5030a1/terraform-bin plan -out=tfplan -no-color
module.s3_alb_logs.data.aws_partition.current: Reading...
module.route53_zone.aws_route53_zone.this["aidoctors.com"]: Refreshing state... [id=Z07552261L3Y3JSSNSTHB]
module.ecr.data.aws_caller_identity.current: Reading...
module.ecr.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]
module.s3_alb_logs.data.aws_region.current: Reading...
module.s3_alb_logs.data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05686e7dc52f8f6df]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=aidoctors-ecs-task-execution-role]
module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z07552261L3Y3JSSNSTHB__e3a8f7bd6e15ea47b4ea7302a8b7a996.aidoctors.com._CNAME]
module.acm.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-2:521538197756:certificate/0f3c03bb-da3c-4851-9126-1dd459f79757]
module.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr.data.aws_partition.current: Reading...
module.ecr.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_alb_logs.aws_s3_bucket.this[0]: Refreshing state... [id=aidoctors-alb-logs]
aws_iam_role.ecs_task_role: Refreshing state... [id=aidoctors-ecs-task-role]
module.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
module.ecr.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
module.ecr.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]
module.ecr.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]
module.ecr.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]
aws_iam_role_policy.ecs_task_execution_ecr_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role:aidoctors-ecs-task-execution-ecr-policy]
aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.s3_alb_logs.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Reading...
module.s3_alb_logs.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Reading...
module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Read complete after 0s [id=2281510643]
module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Read complete after 0s [id=1261215049]
module.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Reading...
module.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=2642795832]
module.s3_alb_logs.aws_s3_bucket_policy.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fc63c4d494374dd6]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083c0db3e1395fded]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0032386130964171e]
module.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03ed752e073dfbab3]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-043f4c0120570ae34]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07bf335ed55e1233f]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00181454359ad7fee]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f7d82a180ace47f4]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09431dd1309dfe33a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f5eb680acf65fea3]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c5b5757a4ad55762]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-073019d7ba4d1ac80]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bf70d3f2fadcfb41]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-07efa2bcb551685bd]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-038f6ff47eba184f5]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030857cf79d386198]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f7d82a180ace47f41080289494]
module.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3542370404]
module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3263409970]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08ce7f62a5a36df2c]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bbaf291468d476f3]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-060bb021411c4af84]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c43d4e8b4f48b114]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-073ba5a5e32dc7574]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-061c36c6e2b02f39c]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e24a561bd9bff913]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-060795adfd71d2087]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f5eb680acf65fea31080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09431dd1309dfe33a1080289494]
module.db.module.db_instance.data.aws_partition.current: Reading...
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.alb.data.aws_partition.current[0]: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.alb.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=3ECwjw]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-20251029162216762800000001]
module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]
module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]
module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]
module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-YUAZASCKMEEFMFFXGN37R4GCT4]
module.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:521538197756:secret:rds!db-cbfeed5f-8f40-443b-9729-9c3f489f3b09-uO760T]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_role_policy.ecs_task_role_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_role_policy" {
      + id          = (known after apply)
      + name        = "aidoctors-ecs-task-role-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3.*",
                          + "ecr.*",
                          + "ecs.*",
                          + "rds.*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "aidoctors-ecs-task-role"
    }

  # aws_route53_record.root will be created
  + resource "aws_route53_record" "root" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "aidoctors.com"
      + type            = "A"
      + zone_id         = "Z07552261L3Y3JSSNSTHB"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "Security group for ECS tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic from ALB"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "aidoctors-ecs-tasks-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "aidoctors-ecs-tasks-sg"
        }
      + tags_all               = {
          + "Name" = "aidoctors-ecs-tasks-sg"
        }
      + vpc_id                 = "vpc-05686e7dc52f8f6df"
    }

  # module.acm.aws_acm_certificate.this[0] will be destroyed
  # (because aws_acm_certificate.this is not in configuration)
  - resource "aws_acm_certificate" "this" {
      - arn                       = "arn:aws:acm:us-east-2:521538197756:certificate/0f3c03bb-da3c-4851-9126-1dd459f79757" -> null
      - domain_name               = "aidoctors.com" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "*.aidoctors.com"
              - resource_record_name  = "_e3a8f7bd6e15ea47b4ea7302a8b7a996.aidoctors.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_fedc5385bf6723dbd72b0455c2b33ed5.jkddzztszm.acm-validations.aws."
            },
          - {
              - domain_name           = "aidoctors.com"
              - resource_record_name  = "_e3a8f7bd6e15ea47b4ea7302a8b7a996.aidoctors.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_fedc5385bf6723dbd72b0455c2b33ed5.jkddzztszm.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-2:521538197756:certificate/0f3c03bb-da3c-4851-9126-1dd459f79757" -> null
      - key_algorithm             = "RSA_2048" -> null
      - pending_renewal           = false -> null
      - region                    = "us-east-2" -> null
      - renewal_eligibility       = "INELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "PENDING_VALIDATION" -> null
      - subject_alternative_names = [
          - "*.aidoctors.com",
          - "aidoctors.com",
        ] -> null
      - tags                      = {
          - "Name" = "aidoctors-certificate"
        } -> null
      - tags_all                  = {
          - "Name" = "aidoctors-certificate"
        } -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null
        # (4 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
          - export                                      = "DISABLED" -> null
        }
    }

  # module.acm.aws_route53_record.validation[0] will be destroyed
  # (because aws_route53_record.validation is not in configuration)
  - resource "aws_route53_record" "validation" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_e3a8f7bd6e15ea47b4ea7302a8b7a996.aidoctors.com" -> null
      - id                               = "Z07552261L3Y3JSSNSTHB__e3a8f7bd6e15ea47b4ea7302a8b7a996.aidoctors.com._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_e3a8f7bd6e15ea47b4ea7302a8b7a996.aidoctors.com" -> null
      - records                          = [
          - "_fedc5385bf6723dbd72b0455c2b33ed5.jkddzztszm.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z07552261L3Y3JSSNSTHB" -> null
        # (2 unchanged attributes hidden)
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "aidoctors-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "us-east-2"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-00181454359ad7fee",
          + "subnet-07bf335ed55e1233f",
        ]
      + tags                                                         = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                     = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = "aidoctors-alb-logs"
          + enabled = true
        }

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb_listener.this["ex-http"] will be created
  + resource "aws_lb_listener" "this" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + region                                                                = "us-east-2"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                              = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_target_group.this["aidoctors-application"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = "true"
      + name                               = (known after apply)
      + name_prefix                        = "aid"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "us-east-2"
      + slow_start                         = 0
      + tags                               = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                           = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-05686e7dc52f8f6df"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.alb.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for aidoctors-alb application load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "aidoctors-alb-"
      + owner_id               = (known after apply)
      + region                 = "us-east-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                 = "vpc-05686e7dc52f8f6df"
    }

  # module.alb.aws_vpc_security_group_egress_rule.this["all"] will be created
  + resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "us-east-2"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "aidoctors-alb-all"
        }
      + tags_all               = {
          + "Name" = "aidoctors-alb-all"
        }
    }

  # module.alb.aws_vpc_security_group_ingress_rule.this["all_http"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "HTTP web traffic"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-2"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "aidoctors-alb-all_http"
        }
      + tags_all               = {
          + "Name" = "aidoctors-alb-all_http"
        }
      + to_port                = 80
    }

  # module.alb.aws_vpc_security_group_ingress_rule.this["all_https"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "HTTPS web traffic"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-2"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "aidoctors-alb-all_https"
        }
      + tags_all               = {
          + "Name" = "aidoctors-alb-all_https"
        }
      + to_port                = 443
    }

  # module.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket                                 = "aidoctors-alb-logs"
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "us-east-2"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "log-retention"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = false
            }

          + filter {
                # (1 unchanged attribute hidden)
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 90
              + storage_class = "GLACIER"
            }
        }
    }

Plan: 11 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.s3_alb_logs.data.aws_partition.current: Reading...%0Amodule.route53_zone.aws_route53_zone.this["aidoctors.com"]: Refreshing state... [id=Z07552261L3Y3JSSNSTHB]%0Amodule.ecr.data.aws_caller_identity.current: Reading...%0Amodule.ecr.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.s3_alb_logs.data.aws_region.current: Reading...%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Reading...%0Amodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05686e7dc52f8f6df]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=aidoctors-ecs-task-execution-role]%0Amodule.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z07552261L3Y3JSSNSTHB__e3a8f7bd6e15ea47b4ea7302a8b7a996.aidoctors.com._CNAME]%0Amodule.acm.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-2:521538197756:certificate/0f3c03bb-da3c-4851-9126-1dd459f79757]%0Amodule.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-2]%0Amodule.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.ecr.data.aws_partition.current: Reading...%0Amodule.ecr.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.s3_alb_logs.aws_s3_bucket.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Aaws_iam_role.ecs_task_role: Refreshing state... [id=aidoctors-ecs-task-role]%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Amodule.ecr.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Amodule.ecr.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecr.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]%0Amodule.ecr.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.ecr.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Aaws_iam_role_policy.ecs_task_execution_ecr_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role:aidoctors-ecs-task-execution-ecr-policy]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]%0Amodule.s3_alb_logs.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Reading...%0Amodule.s3_alb_logs.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Reading...%0Amodule.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Read complete after 0s [id=2281510643]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Read complete after 0s [id=1261215049]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Reading...%0Amodule.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=2642795832]%0Amodule.s3_alb_logs.aws_s3_bucket_policy.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fc63c4d494374dd6]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083c0db3e1395fded]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0032386130964171e]%0Amodule.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03ed752e073dfbab3]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-043f4c0120570ae34]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07bf335ed55e1233f]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00181454359ad7fee]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f7d82a180ace47f4]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09431dd1309dfe33a]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f5eb680acf65fea3]%0Amodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c5b5757a4ad55762]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-073019d7ba4d1ac80]%0Amodule.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bf70d3f2fadcfb41]%0Amodule.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-07efa2bcb551685bd]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-038f6ff47eba184f5]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030857cf79d386198]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f7d82a180ace47f41080289494]%0Amodule.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3542370404]%0Amodule.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3263409970]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08ce7f62a5a36df2c]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bbaf291468d476f3]%0Amodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-060bb021411c4af84]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c43d4e8b4f48b114]%0Amodule.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-073ba5a5e32dc7574]%0Amodule.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-061c36c6e2b02f39c]%0Amodule.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e24a561bd9bff913]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-060795adfd71d2087]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f5eb680acf65fea31080289494]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09431dd1309dfe33a1080289494]%0Amodule.db.module.db_instance.data.aws_partition.current: Reading...%0Amodule.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...%0Amodule.alb.data.aws_partition.current[0]: Reading...%0Amodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]%0Amodule.alb.data.aws_partition.current[0]: Read complete after 0s [id=aws]%0Amodule.db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=3ECwjw]%0Amodule.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-20251029162216762800000001]%0Amodule.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]%0Amodule.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]%0Amodule.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-YUAZASCKMEEFMFFXGN37R4GCT4]%0Amodule.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:521538197756:secret:rds!db-cbfeed5f-8f40-443b-9729-9c3f489f3b09-uO760T]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_role_policy.ecs_task_role_policy will be created%0A  + resource "aws_iam_role_policy" "ecs_task_role_policy" {%0A      + id          = (known after apply)%0A      + name        = "aidoctors-ecs-task-role-policy"%0A      + name_prefix = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "logs:CreateLogGroup",%0A                          + "logs:CreateLogStream",%0A                          + "logs:PutLogEvents",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "s3.*",%0A                          + "ecr.*",%0A                          + "ecs.*",%0A                          + "rds.*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + role        = "aidoctors-ecs-task-role"%0A    }%0A%0A  # aws_route53_record.root will be created%0A  + resource "aws_route53_record" "root" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "aidoctors.com"%0A      + type            = "A"%0A      + zone_id         = "Z07552261L3Y3JSSNSTHB"%0A%0A      + alias {%0A          + evaluate_target_health = true%0A          + name                   = (known after apply)%0A          + zone_id                = (known after apply)%0A        }%0A    }%0A%0A  # aws_security_group.ecs_tasks will be created%0A  + resource "aws_security_group" "ecs_tasks" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for ECS tasks"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "Allow all outbound traffic"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = []%0A              + description      = "Allow traffic from ALB"%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = (known after apply)%0A              + self             = false%0A              + to_port          = 80%0A            },%0A        ]%0A      + name                   = "aidoctors-ecs-tasks-sg"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + region                 = "us-east-2"%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "aidoctors-ecs-tasks-sg"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-ecs-tasks-sg"%0A        }%0A      + vpc_id                 = "vpc-05686e7dc52f8f6df"%0A    }%0A%0A  # module.acm.aws_acm_certificate.this[0] will be destroyed%0A  # (because aws_acm_certificate.this is not in configuration)%0A  - resource "aws_acm_certificate" "this" {%0A      - arn                       = "arn:aws:acm:us-east-2:521538197756:certificate/0f3c03bb-da3c-4851-9126-1dd459f79757" -> null%0A      - domain_name               = "aidoctors.com" -> null%0A      - domain_validation_options = [%0A          - {%0A              - domain_name           = "*.aidoctors.com"%0A              - resource_record_name  = "_e3a8f7bd6e15ea47b4ea7302a8b7a996.aidoctors.com."%0A              - resource_record_type  = "CNAME"%0A              - resource_record_value = "_fedc5385bf6723dbd72b0455c2b33ed5.jkddzztszm.acm-validations.aws."%0A            },%0A          - {%0A              - domain_name           = "aidoctors.com"%0A              - resource_record_name  = "_e3a8f7bd6e15ea47b4ea7302a8b7a996.aidoctors.com."%0A              - resource_record_type  = "CNAME"%0A              - resource_record_value = "_fedc5385bf6723dbd72b0455c2b33ed5.jkddzztszm.acm-validations.aws."%0A            },%0A        ] -> null%0A      - id                        = "arn:aws:acm:us-east-2:521538197756:certificate/0f3c03bb-da3c-4851-9126-1dd459f79757" -> null%0A      - key_algorithm             = "RSA_2048" -> null%0A      - pending_renewal           = false -> null%0A      - region                    = "us-east-2" -> null%0A      - renewal_eligibility       = "INELIGIBLE" -> null%0A      - renewal_summary           = [] -> null%0A      - status                    = "PENDING_VALIDATION" -> null%0A      - subject_alternative_names = [%0A          - "*.aidoctors.com",%0A          - "aidoctors.com",%0A        ] -> null%0A      - tags                      = {%0A          - "Name" = "aidoctors-certificate"%0A        } -> null%0A      - tags_all                  = {%0A          - "Name" = "aidoctors-certificate"%0A        } -> null%0A      - type                      = "AMAZON_ISSUED" -> null%0A      - validation_emails         = [] -> null%0A      - validation_method         = "DNS" -> null%0A        # (4 unchanged attributes hidden)%0A%0A      - options {%0A          - certificate_transparency_logging_preference = "ENABLED" -> null%0A          - export                                      = "DISABLED" -> null%0A        }%0A    }%0A%0A  # module.acm.aws_route53_record.validation[0] will be destroyed%0A  # (because aws_route53_record.validation is not in configuration)%0A  - resource "aws_route53_record" "validation" {%0A      - allow_overwrite                  = true -> null%0A      - fqdn                             = "_e3a8f7bd6e15ea47b4ea7302a8b7a996.aidoctors.com" -> null%0A      - id                               = "Z07552261L3Y3JSSNSTHB__e3a8f7bd6e15ea47b4ea7302a8b7a996.aidoctors.com._CNAME" -> null%0A      - multivalue_answer_routing_policy = false -> null%0A      - name                             = "_e3a8f7bd6e15ea47b4ea7302a8b7a996.aidoctors.com" -> null%0A      - records                          = [%0A          - "_fedc5385bf6723dbd72b0455c2b33ed5.jkddzztszm.acm-validations.aws.",%0A        ] -> null%0A      - ttl                              = 60 -> null%0A      - type                             = "CNAME" -> null%0A      - zone_id                          = "Z07552261L3Y3JSSNSTHB" -> null%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.alb.aws_lb.this[0] will be created%0A  + resource "aws_lb" "this" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = true%0A      + enable_deletion_protection                                   = true%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enable_zonal_shift                                           = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = (known after apply)%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "aidoctors-alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + region                                                       = "us-east-2"%0A      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)%0A      + security_groups                                              = (known after apply)%0A      + subnets                                                      = [%0A          + "subnet-00181454359ad7fee",%0A          + "subnet-07bf335ed55e1233f",%0A        ]%0A      + tags                                                         = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tags_all                                                     = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A%0A      + access_logs {%0A          + bucket  = "aidoctors-alb-logs"%0A          + enabled = true%0A        }%0A%0A      + subnet_mapping (known after apply)%0A    }%0A%0A  # module.alb.aws_lb_listener.this["ex-http"] will be created%0A  + resource "aws_lb_listener" "this" {%0A      + arn                                                                   = (known after apply)%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 80%0A      + protocol                                                              = "HTTP"%0A      + region                                                                = "us-east-2"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = (known after apply)%0A      + tags                                                                  = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tags_all                                                              = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + mutual_authentication (known after apply)%0A    }%0A%0A  # module.alb.aws_lb_target_group.this["aidoctors-application"] will be created%0A  + resource "aws_lb_target_group" "this" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "30"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = "true"%0A      + name                               = (known after apply)%0A      + name_prefix                        = "aid"%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + region                             = "us-east-2"%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tags_all                           = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + target_type                        = "ip"%0A      + vpc_id                             = "vpc-05686e7dc52f8f6df"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 30%0A          + matcher             = "200"%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 3%0A        }%0A%0A      + stickiness (known after apply)%0A%0A      + target_failover (known after apply)%0A%0A      + target_group_health (known after apply)%0A%0A      + target_health_state (known after apply)%0A    }%0A%0A  # module.alb.aws_security_group.this[0] will be created%0A  + resource "aws_security_group" "this" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for aidoctors-alb application load balancer"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "aidoctors-alb-"%0A      + owner_id               = (known after apply)%0A      + region                 = "us-east-2"%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tags_all               = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + vpc_id                 = "vpc-05686e7dc52f8f6df"%0A    }%0A%0A  # module.alb.aws_vpc_security_group_egress_rule.this["all"] will be created%0A  + resource "aws_vpc_security_group_egress_rule" "this" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "10.0.0.0/16"%0A      + id                     = (known after apply)%0A      + ip_protocol            = "-1"%0A      + region                 = "us-east-2"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "aidoctors-alb-all"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-alb-all"%0A        }%0A    }%0A%0A  # module.alb.aws_vpc_security_group_ingress_rule.this["all_http"] will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "this" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "HTTP web traffic"%0A      + from_port              = 80%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + region                 = "us-east-2"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "aidoctors-alb-all_http"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-alb-all_http"%0A        }%0A      + to_port                = 80%0A    }%0A%0A  # module.alb.aws_vpc_security_group_ingress_rule.this["all_https"] will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "this" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "HTTPS web traffic"%0A      + from_port              = 443%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + region                 = "us-east-2"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "aidoctors-alb-all_https"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-alb-all_https"%0A        }%0A      + to_port                = 443%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0] will be created%0A  + resource "aws_s3_bucket_lifecycle_configuration" "this" {%0A      + bucket                                 = "aidoctors-alb-logs"%0A      + expected_bucket_owner                  = (known after apply)%0A      + id                                     = (known after apply)%0A      + region                                 = "us-east-2"%0A      + transition_default_minimum_object_size = "all_storage_classes_128K"%0A%0A      + rule {%0A          + id     = "log-retention"%0A          + status = "Enabled"%0A            # (1 unchanged attribute hidden)%0A%0A          + expiration {%0A              + days                         = 365%0A              + expired_object_delete_marker = false%0A            }%0A%0A          + filter {%0A                # (1 unchanged attribute hidden)%0A            }%0A%0A          + transition {%0A              + days          = 30%0A              + storage_class = "STANDARD_IA"%0A            }%0A          + transition {%0A              + days          = 90%0A              + storage_class = "GLACIER"%0A            }%0A        }%0A    }%0A%0APlan: 11 to add, 0 to change, 2 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @TerryTian21, Action: `pull_request`, Workflow: `Terraform PR Check`*